[
  {
    "url": "https://ria.ru/20250721/obstrel-2030321423.html",
    "date": "00:42 21.07.2025",
    "title": "Украинские войска за сутки четыре раза обстреляли территорию ДНР",
    "text": "ДОНЕЦК, 21 июл - РИА Новости. Украинские войска четыре раза за минувшие сутки обстреляли территорию ДНР, выпустив шесть боеприпасов, сообщает управление администрации главы и правительства республики по вопросам документирования военных преступлений Украины. "
  },
  {
    "url": "https://ria.ru/20250720/germaniya-2030309345.html",
    "date": "21:14 20.07.2025(обновлено: 21:15 20.07.2025)",
    "title": "Немцы не понимают, почему власти дарят Украине миллиарды, заявила Вайдель",
    "text": "БЕРЛИН, 20 июл - РИА Новости. Жители Германии не понимают, почему правительство под руководством канцлера Фридриха Мерца дарит Украине миллиарды евро налогоплательщиков, но на собственных граждан не находит средств, заявила в интервью телеканалу ARD сопредседатель партии \"Альтернатива для Германии\" Алиса Вайдель. "
  },
  {
    "url": "https://ria.ru/20250721/bespilotnik-2030324927.html",
    "date": "01:46 21.07.2025(обновлено: 01:48 21.07.2025)",
    "title": "ПВО сбила беспилотник, летевший на Москву",
    "text": "МОСКВА, 21 июл - РИА Новости. Уничтожен беспилотник, летевший на Москву, сообщил в Telegram-канале мэр столицы Сергей Собянин."
  },
  {
    "url": "https://ria.ru/20250720/opasnost-2030314842.html",
    "date": "22:49 20.07.2025",
    "title": "В Ростовской области объявили опасность атаки беспилотников",
    "text": "МОСКВА, 20 июл - РИА Новости. Опасность атаки беспилотников объявлена на всей территории Ростовской области, сообщается в приложении МЧС России. "
  },
  {
    "url": "https://ria.ru/20250721/bespilotnik-2030319676.html",
    "date": "00:02 21.07.2025",
    "title": "ПВО уничтожила еще два беспилотника, летевших на Москву",
    "text": "МОСКВА, 21 июл - РИА Новости. Уничтожены ещё два беспилотника, летевшие на Москву, сообщил в Telegram-канале мэр столицы Сергей Собянин. "
  },
  {
    "url": "https://ria.ru/20250720/vzryvy-2030313218.html",
    "date": "22:17 20.07.2025",
    "title": "В Днепропетровской области прогремели взрывы",
    "text": "МОСКВА, 20 июл – РИА Новости. Взрывы второй раз за день прогремели в городе Павлоград Днепропетровской области Украины на фоне объявленной в регионе воздушной тревоги, сообщил украинский телеканал \"Общественное\". "
  },
  {
    "url": "https://ria.ru/20250720/ukraina-2030314156.html",
    "date": "22:34 20.07.2025",
    "title": "В семи областях Украины объявили воздушную тревогу",
    "text": "МОСКВА, 20 июл - РИА Новости. Воздушная тревога объявлена в Киевской, Николаевской, Полтавской, Харьковской, Черниговской, Днепропетровской и Сумской областях Украины, свидетельствуют данные онлайн-карты украинского министерства цифровой трансформации. "
  },
  {
    "url": "https://ria.ru/20250720/bpla-2030316090.html",
    "date": "23:12 20.07.2025",
    "title": "В Воронежской области отменили опасность атаки БПЛА",
    "text": "МОСКВА, 20 июл - РИА Новости. Опасность атаки БПЛА отменена в Воронежской области, сообщил губернатор Александр Гусев. "
  },
  {
    "url": "https://ria.ru/20250721/bespilotniki-2030319388.html",
    "date": "00:01 21.07.2025(обновлено: 00:45 21.07.2025)",
    "title": "ПВО вечером уничтожила 43 украинских беспилотника над регионами России",
    "text": "МОСКВА, 21 июл — РИА Новости. ПВО вечером в воскресенье уничтожила еще 43 украинских беспилотника над пятью российскими регионами, сообщило Минобороны."
  },
  {
    "url": "https://ria.ru/20250721/pozhar-2030323724.html",
    "date": "01:19 21.07.2025(обновлено: 01:37 21.07.2025)",
    "title": "В Ростовской области после падения БПЛА загорелась крыша вокзала",
    "text": "МОСКВА, 21 июл - РИА Новости. Крыша железнодорожного вокзала загорелась в поселке Каменоломни в Октябрьском районе Ростовской области после падения обломков БПЛА, сообщил в Telegram-канале врио губернатора Юрий Слюсарь."
  },
  {
    "url": "https://ria.ru/20250721/vzryvy-2030324680.html",
    "date": "01:41 21.07.2025",
    "title": "В Днепропетровске и Харькове прогремели взрывы",
    "text": "МОСКВА, 21 июл - РИА Новости. Взрывы прогремели в Днепропетровске и Харькове, сообщает украинский телеканал \"Общественное\". "
  },
  {
    "url": "https://ria.ru/20250721/bespilotnik-2030320947.html",
    "date": "00:25 21.07.2025(обновлено: 00:26 21.07.2025)",
    "title": "ПВО сбила беспилотник, летевший на Москву",
    "text": "МОСКВА, 21 июл - РИА Новости. Уничтожен беспилотник, летевший на Москву, сообщил в Telegram-канале мэр столицы Сергей Собянин."
  },
  {
    "url": "https://ria.ru/20250721/bespilotniki-2030322803.html",
    "date": "01:01 21.07.2025",
    "title": "ПВО сбила два беспилотника, летевших на Москву",
    "text": "МОСКВА, 21 июл - РИА Новости. Уничтожены ещё два беспилотника, летевшие на Москву, сообщил в Telegram-канале мэр столицы Сергей Собянин."
  },
  {
    "url": "https://ria.ru/20250721/trevoga-2030321065.html",
    "date": "00:29 21.07.2025(обновлено: 00:45 21.07.2025)",
    "title": "На всей территории Украины объявили воздушную тревогу",
    "text": "МОСКВА, 21 июл — РИА Новости. Воздушная тревога объявлена во всех областях Украины, свидетельствуют данные онлайн-карты украинского министерства цифровой трансформации."
  },
  {
    "url": "https://ria.ru/20250721/vzryvy-2030322928.html",
    "date": "01:02 21.07.2025(обновлено: 01:10 21.07.2025)",
    "title": "В Киеве прогремели взрывы",
    "text": "МОСКВА, 21 июл - РИА Новости. Взрывы прогремели в Киеве на фоне объявленной в городе воздушной тревоги, сообщил украинский телеканал \"Общественное\" в своем в Telegram-канале. "
  },
  {
    "url": "https://ria.ru/20250720/vsu-2030311202.html",
    "date": "21:37 20.07.2025",
    "title": "В Донецке при сбросе взрывоопасного предмета с дрона ВСУ пострадал мужчина",
    "text": "МОСКВА, 20 июл - РИА Новости. Мирный житель был ранен в результате сброса взрывоопасного предмета с дрона ВСУ в Донецке, сообщил глава ДНР Денис Пушилин. "
  },
  {
    "url": "https://ria.ru/20250720/opasnost-2030316271.html",
    "date": "23:15 20.07.2025",
    "title": "В Воронежской области вновь объявили опасность атаки БПЛА",
    "text": "МОСКВА, 20 июл - РИА Новости. Губернатор Воронежской области Александр Гусев вновь предупредил об опасности атаки БПЛА в регионе и заверил, что силы ПВО наготове. "
  },
  {
    "url": "https://ria.ru/20250720/bpla-2030311357.html",
    "date": "21:42 20.07.2025",
    "title": "В Елецком районе Липецкой области объявили опасность атаки беспилотников",
    "text": "МОСКВА, 20 июл - РИА Новости. Опасность атаки беспилотников объявлена в городе Елец и Елецком муниципальном районе Липецкой области, сообщает главное управление МЧС по региону. "
  },
  {
    "url": "https://ria.ru/20250720/opasnost-2030316647.html",
    "date": "23:19 20.07.2025",
    "title": "На Кубани объявили опасность атаки беспилотников",
    "text": "МОСКВА, 20 июл - РИА Новости. Опасность БПЛА объявлена в Краснодарском крае, сообщается в приложении МЧС России. "
  },
  {
    "url": "https://ria.ru/20250721/bespilotnik-2030325472.html",
    "date": "01:58 21.07.2025",
    "title": "ПВО уничтожили еще один беспилотник, летевший на Москву",
    "text": "МОСКВА, 21 июл - РИА Новости. Уничтожен беспилотник, летевший на Москву, сообщил в Telegram-канале мэр столицы Сергей Собянин. "
  }
]